In [55]:
import pandas as pd
import numpy as np

df = {'nome': ['João','Pedro','Julia','Reis'],
       'idade' : [18,19,20,21],
       'sexo' : ['M','M','F','F'],
       'vazia' : [np.nan] *4}

df = pd.DataFrame(df)
df

df['add'] = [1,2,3,4]   # adicionar novas colunas
df

    nome  idade sexo  vazia  add
0   João     18    M    NaN    1
1  Pedro     19    M    NaN    2
2  Julia     20    F    NaN    3
3   Reis     21    F    NaN    4

# RENAME

In [57]:
df.rename(columns = {'add':'adicionar', 'vazia' : 'remova'}, inplace = True)
df

    nome  idade sexo  remova  adicionar
0   João     18    M     NaN          1
1  Pedro     19    M     NaN          2
2  Julia     20    F     NaN          3
3   Reis     21    F     NaN          4

In [47]:
df.rename(index = {1 : 'primeiro'}, inplace = True)

# DROP

In [51]:
df.drop('remova', axis = 1, inplace = True)

In [53]:
df

           nome  idade sexo  adicionar
0          João     18    M          1
primeiro  Pedro     19    M          2
2         Julia     20    F          3
3          Reis     21    F          4